// Задайте массив из 12 элементов, заполненный случайными числами из промежутка [-9, 9]. Найдите сумму отрицательных элементов массива.
/*
int[] CreateRandomArray(int size,int minValue,maxValue)

int GetSumOfNegative(int[] array)
{
    int sum =0;
    for(i=0;i<array.Length;i++)
    {
        if(array[i]<0)
        {
            sum+=array[i];
        }
    }
    return sum;
}

Console.Write("input a lenght of array: ");
int lenght = Convert.ToInt32(Console.ReadLine());
Console.Write("input a lenght of array: ");
int min = Convert.ToInt32(Console.ReadLine());
Console.Write("input a lenght of array: ");
int max = Convert.ToInt32(Console.ReadLine());

int[] newArray = CreateRandomArray(lenght);


*/



// Задача 1.Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.



// Задача 2.Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.



// Задача 3.Задайте одномерный массив из m случайных чисел. Найдите количество элементов массива, значения которых лежат в отрезке [a,b].
