/*

//Задача 1.Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.

Console.Write("Input a number(Введите число 1): ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a number(Введите число 2): ");
int number2 = Convert.ToInt32(Console.ReadLine());


if (number1 == number2*number2)
{
    Console.WriteLine("Yes(является)");
}
else
{
     Console.WriteLine("No(не является)");
}


// int quad2 = num2*num2;
//if(num1 == qaud2)
//{
//
//}
//{
//
//}


*/
/*
//задача 2.Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.

Console.Write("Input a number(Введите число ): ");
int num1 = Convert.ToInt32(Console.ReadLine());
int current = num1 * -1; // -number
while(current <= num1)
{
    Console.Write(current+ " ");
    current++ ; // счетчик 
}
*/
//задача 3